content/roam/20220411103644-blmp_devel.org
:PROPERTIES:
:ID:       39fa9095-e971-4b1e-9550-fab0045aaa8e
:END:
#+title: BLMP-devel

[[./20220406135530-devel_project.org][devel-project]]

* Algorithm
** fine grid search, hyperparameter improvement
*** hyperparameter: layer number, hidden dimension, learning rate
** inference logics
** masking logic (pytorch)
** convergence
*** WGAN
*** WGAN-GP (not trained)
** counter measure for limited samples (overfitting of discriminator!)
*** Training Generative Adversarial Networks with Limited Data [T Karras 2020]
*** data augmentation: slice, segment, (leaking of augmentation distribution)
** VQ-VAE
** Diffusion Model
*** set up toy example for coding
*** testing on real data in a controlled small range
** training harness for model training and development

* Data
** outlier highlighting
*** BLMP 2.0 outlier
**** charging signals of in question battery (found)
*** Ascending, Descending
*** high frequent signal （no high frequent signals after rescaling)
** cluster interpretation （reverse finding）
** dataset update by production data from cloud
** need private repository to publish upgrade
* Cloud
** data cycle
*** traning: model, checkpoint, data
*** inferring
*** message posting
** code cycle
*** version control (gitlab)
*** package publishing
*** 3rd party package upgrade
** service
*** running http server on the cloud through truss
*** timer scheduling (cran job, etc.)
** datastore
*** csv files
*** database
*** pystore (no database)
* Coding
** code squeeze
** debugging
** refactoring
*** checkpointing
*** training resuming
** packaging
** profiling
** DL fine-tuning harness

* Data and model review
** <2022-04-12 Tue>
*** TODO 2.0 percentage outlier position :battery:
DEADLINE: <2022-04-26 Tue>
**** observation
***** VIN: 8349:20 --> 20,21
***** TimeGAN not converged yet, but embedding can be used for clustering
***** feature:
****** battery pack avergage diff
****** can: 全天 相邻 traveltime， 中断 20min,1hour,<60mA，静息电压；
****** 一个电池包的差分,任意时刻
**** unsafe label?
**** meaning?
***** 0, --> -1,-2,-3; 1st order difference: 一阶差分，极化变化率
*** TODO cluster outlier reverse mapping :battery:
DEADLINE: <2022-04-29 Fri>
*** new VIN data
*** code alignment
**** aligning pytorch codebase with tensorflow (with stock data and hyperparameter, ie short sequence length)
**** retrain battery charging timeseries with aligned hyperparameter, short seq. length, without mode collapse
**** increase sequence length (long training) to improve timeseries resolution
*** use transformer
*** use
** <2022-05-16 Mon>
*** 温度
**** 容量，阻抗和自放电
**** 基线：静息温度，
