docs/20220411103644-blmp_devel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>BLMP-devel</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">BLMP-devel</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1f3fd28">Algorithm</a>
<ul>
<li><a href="#org95bf654">fine grid search, hyperparameter improvement</a>
<ul>
<li><a href="#org28becd4">hyperparameter: layer number, hidden dimension, learning rate</a></li>
</ul>
</li>
<li><a href="#org296ed09">inference logics</a></li>
<li><a href="#org4868089">masking logic (pytorch)</a></li>
<li><a href="#orga377c06">convergence</a>
<ul>
<li><a href="#orgbe97dd9">WGAN</a></li>
<li><a href="#org19ec2bb">WGAN-GP (not trained)</a></li>
</ul>
</li>
<li><a href="#org98d538a">counter measure for limited samples (overfitting of discriminator!)</a>
<ul>
<li><a href="#orga5d3694">Training Generative Adversarial Networks with Limited Data [T Karras 2020]</a></li>
<li><a href="#org6e96adc">data augmentation: slice, segment, (leaking of augmentation distribution)</a></li>
</ul>
</li>
<li><a href="#org5b6510c">VQ-VAE</a></li>
<li><a href="#orgafee3be">Diffusion Model</a>
<ul>
<li><a href="#orgf4f4453">set up toy example for coding</a></li>
<li><a href="#org4830b08">testing on real data in a controlled small range</a></li>
</ul>
</li>
<li><a href="#orgf550e24">training harness for model training and development</a></li>
</ul>
</li>
<li><a href="#org58c95cf">Data</a>
<ul>
<li><a href="#orgf0cbcf4">outlier highlighting</a>
<ul>
<li><a href="#org84183a7">BLMP 2.0 outlier</a></li>
<li><a href="#org011d2ee">Ascending, Descending</a></li>
<li><a href="#org5ff9751">high frequent signal （no high frequent signals after rescaling)</a></li>
</ul>
</li>
<li><a href="#org0230fe2">cluster interpretation （reverse finding）</a></li>
<li><a href="#org4a8f512">dataset update by production data from cloud</a></li>
<li><a href="#org7432097">need private repository to publish upgrade</a></li>
</ul>
</li>
<li><a href="#org30f9bb7">Cloud</a>
<ul>
<li><a href="#org67a0ae0">data cycle</a>
<ul>
<li><a href="#org87535a2">traning: model, checkpoint, data</a></li>
<li><a href="#org57d2954">inferring</a></li>
<li><a href="#org5ef5998">message posting</a></li>
</ul>
</li>
<li><a href="#org59b7c66">code cycle</a>
<ul>
<li><a href="#orgf77640c">version control (gitlab)</a></li>
<li><a href="#orgacdaf70">package publishing</a></li>
<li><a href="#org7ee9be4">3rd party package upgrade</a></li>
</ul>
</li>
<li><a href="#org6cda343">service</a>
<ul>
<li><a href="#org6437e7b">running http server on the cloud through truss</a></li>
<li><a href="#orgbf51012">timer scheduling (cran job, etc.)</a></li>
</ul>
</li>
<li><a href="#orgf68a506">datastore</a>
<ul>
<li><a href="#orgdd3ba59">csv files</a></li>
<li><a href="#org72c6775">database</a></li>
<li><a href="#orgc43f131">pystore (no database)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc11c78e">Coding</a>
<ul>
<li><a href="#orge2a48b9">code squeeze</a></li>
<li><a href="#org9570d92">debugging</a></li>
<li><a href="#orgaf206d5">refactoring</a>
<ul>
<li><a href="#orgc125410">checkpointing</a></li>
<li><a href="#org9f5e70a">training resuming</a></li>
</ul>
</li>
<li><a href="#org30d4b13">packaging</a></li>
<li><a href="#org569c017">profiling</a></li>
<li><a href="#org76b6a71">DL fine-tuning harness</a></li>
</ul>
</li>
<li><a href="#org83b7bee">Data and model review</a>
<ul>
<li><a href="#orga494293"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-12 Tue&gt;</span></span></a>
<ul>
<li><a href="#org3f27633"><span class="todo TODO">TODO</span> 2.0 percentage outlier position&#xa0;&#xa0;&#xa0;<span class="tag"><span class="battery">battery</span></span></a></li>
<li><a href="#orgda474ee"><span class="todo TODO">TODO</span> cluster outlier reverse mapping&#xa0;&#xa0;&#xa0;<span class="tag"><span class="battery">battery</span></span></a></li>
<li><a href="#org684e0d8">new VIN data</a></li>
<li><a href="#org265fb52">code alignment</a></li>
<li><a href="#org86719e7">use transformer</a></li>
<li><a href="#org81fb8f3">use</a></li>
</ul>
</li>
<li><a href="#orgabeceb9"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-05-16 Mon&gt;</span></span></a>
<ul>
<li><a href="#org35a5a10">温度</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="./20220406135530-devel_project.html">devel-project</a>
</p>

<div id="outline-container-org1f3fd28" class="outline-2">
<h2 id="org1f3fd28">Algorithm</h2>
<div class="outline-text-2" id="text-org1f3fd28">
</div>
<div id="outline-container-org95bf654" class="outline-3">
<h3 id="org95bf654">fine grid search, hyperparameter improvement</h3>
<div class="outline-text-3" id="text-org95bf654">
</div>
<div id="outline-container-org28becd4" class="outline-4">
<h4 id="org28becd4">hyperparameter: layer number, hidden dimension, learning rate</h4>
</div>
</div>
<div id="outline-container-org296ed09" class="outline-3">
<h3 id="org296ed09">inference logics</h3>
</div>
<div id="outline-container-org4868089" class="outline-3">
<h3 id="org4868089">masking logic (pytorch)</h3>
</div>
<div id="outline-container-orga377c06" class="outline-3">
<h3 id="orga377c06">convergence</h3>
<div class="outline-text-3" id="text-orga377c06">
</div>
<div id="outline-container-orgbe97dd9" class="outline-4">
<h4 id="orgbe97dd9">WGAN</h4>
</div>
<div id="outline-container-org19ec2bb" class="outline-4">
<h4 id="org19ec2bb">WGAN-GP (not trained)</h4>
</div>
</div>
<div id="outline-container-org98d538a" class="outline-3">
<h3 id="org98d538a">counter measure for limited samples (overfitting of discriminator!)</h3>
<div class="outline-text-3" id="text-org98d538a">
</div>
<div id="outline-container-orga5d3694" class="outline-4">
<h4 id="orga5d3694">Training Generative Adversarial Networks with Limited Data [T Karras 2020]</h4>
</div>
<div id="outline-container-org6e96adc" class="outline-4">
<h4 id="org6e96adc">data augmentation: slice, segment, (leaking of augmentation distribution)</h4>
</div>
</div>
<div id="outline-container-org5b6510c" class="outline-3">
<h3 id="org5b6510c">VQ-VAE</h3>
</div>
<div id="outline-container-orgafee3be" class="outline-3">
<h3 id="orgafee3be">Diffusion Model</h3>
<div class="outline-text-3" id="text-orgafee3be">
</div>
<div id="outline-container-orgf4f4453" class="outline-4">
<h4 id="orgf4f4453">set up toy example for coding</h4>
</div>
<div id="outline-container-org4830b08" class="outline-4">
<h4 id="org4830b08">testing on real data in a controlled small range</h4>
</div>
</div>
<div id="outline-container-orgf550e24" class="outline-3">
<h3 id="orgf550e24">training harness for model training and development</h3>
</div>
</div>

<div id="outline-container-org58c95cf" class="outline-2">
<h2 id="org58c95cf">Data</h2>
<div class="outline-text-2" id="text-org58c95cf">
</div>
<div id="outline-container-orgf0cbcf4" class="outline-3">
<h3 id="orgf0cbcf4">outlier highlighting</h3>
<div class="outline-text-3" id="text-orgf0cbcf4">
</div>
<div id="outline-container-org84183a7" class="outline-4">
<h4 id="org84183a7">BLMP 2.0 outlier</h4>
<div class="outline-text-4" id="text-org84183a7">
</div>
<ul class="org-ul">
<li><a id="orgac76df2"></a>charging signals of in question battery (found)<br /></li>
</ul>
</div>
<div id="outline-container-org011d2ee" class="outline-4">
<h4 id="org011d2ee">Ascending, Descending</h4>
</div>
<div id="outline-container-org5ff9751" class="outline-4">
<h4 id="org5ff9751">high frequent signal （no high frequent signals after rescaling)</h4>
</div>
</div>
<div id="outline-container-org0230fe2" class="outline-3">
<h3 id="org0230fe2">cluster interpretation （reverse finding）</h3>
</div>
<div id="outline-container-org4a8f512" class="outline-3">
<h3 id="org4a8f512">dataset update by production data from cloud</h3>
</div>
<div id="outline-container-org7432097" class="outline-3">
<h3 id="org7432097">need private repository to publish upgrade</h3>
</div>
</div>
<div id="outline-container-org30f9bb7" class="outline-2">
<h2 id="org30f9bb7">Cloud</h2>
<div class="outline-text-2" id="text-org30f9bb7">
</div>
<div id="outline-container-org67a0ae0" class="outline-3">
<h3 id="org67a0ae0">data cycle</h3>
<div class="outline-text-3" id="text-org67a0ae0">
</div>
<div id="outline-container-org87535a2" class="outline-4">
<h4 id="org87535a2">traning: model, checkpoint, data</h4>
</div>
<div id="outline-container-org57d2954" class="outline-4">
<h4 id="org57d2954">inferring</h4>
</div>
<div id="outline-container-org5ef5998" class="outline-4">
<h4 id="org5ef5998">message posting</h4>
</div>
</div>
<div id="outline-container-org59b7c66" class="outline-3">
<h3 id="org59b7c66">code cycle</h3>
<div class="outline-text-3" id="text-org59b7c66">
</div>
<div id="outline-container-orgf77640c" class="outline-4">
<h4 id="orgf77640c">version control (gitlab)</h4>
</div>
<div id="outline-container-orgacdaf70" class="outline-4">
<h4 id="orgacdaf70">package publishing</h4>
</div>
<div id="outline-container-org7ee9be4" class="outline-4">
<h4 id="org7ee9be4">3rd party package upgrade</h4>
</div>
</div>
<div id="outline-container-org6cda343" class="outline-3">
<h3 id="org6cda343">service</h3>
<div class="outline-text-3" id="text-org6cda343">
</div>
<div id="outline-container-org6437e7b" class="outline-4">
<h4 id="org6437e7b">running http server on the cloud through truss</h4>
</div>
<div id="outline-container-orgbf51012" class="outline-4">
<h4 id="orgbf51012">timer scheduling (cran job, etc.)</h4>
</div>
</div>
<div id="outline-container-orgf68a506" class="outline-3">
<h3 id="orgf68a506">datastore</h3>
<div class="outline-text-3" id="text-orgf68a506">
</div>
<div id="outline-container-orgdd3ba59" class="outline-4">
<h4 id="orgdd3ba59">csv files</h4>
</div>
<div id="outline-container-org72c6775" class="outline-4">
<h4 id="org72c6775">database</h4>
</div>
<div id="outline-container-orgc43f131" class="outline-4">
<h4 id="orgc43f131">pystore (no database)</h4>
</div>
</div>
</div>
<div id="outline-container-orgc11c78e" class="outline-2">
<h2 id="orgc11c78e">Coding</h2>
<div class="outline-text-2" id="text-orgc11c78e">
</div>
<div id="outline-container-orge2a48b9" class="outline-3">
<h3 id="orge2a48b9">code squeeze</h3>
</div>
<div id="outline-container-org9570d92" class="outline-3">
<h3 id="org9570d92">debugging</h3>
</div>
<div id="outline-container-orgaf206d5" class="outline-3">
<h3 id="orgaf206d5">refactoring</h3>
<div class="outline-text-3" id="text-orgaf206d5">
</div>
<div id="outline-container-orgc125410" class="outline-4">
<h4 id="orgc125410">checkpointing</h4>
</div>
<div id="outline-container-org9f5e70a" class="outline-4">
<h4 id="org9f5e70a">training resuming</h4>
</div>
</div>
<div id="outline-container-org30d4b13" class="outline-3">
<h3 id="org30d4b13">packaging</h3>
</div>
<div id="outline-container-org569c017" class="outline-3">
<h3 id="org569c017">profiling</h3>
</div>
<div id="outline-container-org76b6a71" class="outline-3">
<h3 id="org76b6a71">DL fine-tuning harness</h3>
</div>
</div>

<div id="outline-container-org83b7bee" class="outline-2">
<h2 id="org83b7bee">Data and model review</h2>
<div class="outline-text-2" id="text-org83b7bee">
</div>
<div id="outline-container-orga494293" class="outline-3">
<h3 id="orga494293"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-12 Tue&gt;</span></span></h3>
<div class="outline-text-3" id="text-orga494293">
</div>
<div id="outline-container-org3f27633" class="outline-4">
<h4 id="org3f27633"><span class="todo TODO">TODO</span> 2.0 percentage outlier position&#xa0;&#xa0;&#xa0;<span class="tag"><span class="battery">battery</span></span></h4>
<div class="outline-text-4" id="text-org3f27633">
</div>
<ul class="org-ul">
<li><a id="orgae5eb05"></a>observation<br />
<ul class="org-ul">
<li><a id="org08df741"></a>VIN: 8349:20 &#x2013;&gt; 20,21<br /></li>
<li><a id="org0790ce6"></a>TimeGAN not converged yet, but embedding can be used for clustering<br /></li>
<li><a id="orgab73639"></a>feature:<br />
<ul class="org-ul">
<li><a id="org2e8f6df"></a>battery pack avergage diff<br /></li>
<li><a id="org4219b6b"></a>can: 全天 相邻 traveltime， 中断 20min,1hour,&lt;60mA，静息电压；<br /></li>
<li><a id="orgb4eb605"></a>一个电池包的差分,任意时刻<br /></li>
</ul>
</li>
</ul>
</li>
<li><a id="orgcd56a8a"></a>unsafe label?<br /></li>
<li><a id="org1ad9335"></a>meaning?<br />
<ul class="org-ul">
<li><a id="org6fd114a"></a>0, &#x2013;&gt; -1,-2,-3; 1st order difference: 一阶差分，极化变化率<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgda474ee" class="outline-4">
<h4 id="orgda474ee"><span class="todo TODO">TODO</span> cluster outlier reverse mapping&#xa0;&#xa0;&#xa0;<span class="tag"><span class="battery">battery</span></span></h4>
<div class="outline-text-4" id="text-orgda474ee">
</div>
</div>
<div id="outline-container-org684e0d8" class="outline-4">
<h4 id="org684e0d8">new VIN data</h4>
</div>
<div id="outline-container-org265fb52" class="outline-4">
<h4 id="org265fb52">code alignment</h4>
<div class="outline-text-4" id="text-org265fb52">
</div>
<ul class="org-ul">
<li><a id="org4472774"></a>aligning pytorch codebase with tensorflow (with stock data and hyperparameter, ie short sequence length)<br /></li>
<li><a id="org1528bc0"></a>retrain battery charging timeseries with aligned hyperparameter, short seq. length, without mode collapse<br /></li>
<li><a id="orgc070fe8"></a>increase sequence length (long training) to improve timeseries resolution<br /></li>
</ul>
</div>
<div id="outline-container-org86719e7" class="outline-4">
<h4 id="org86719e7">use transformer</h4>
</div>
<div id="outline-container-org81fb8f3" class="outline-4">
<h4 id="org81fb8f3">use</h4>
</div>
</div>
<div id="outline-container-orgabeceb9" class="outline-3">
<h3 id="orgabeceb9"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-05-16 Mon&gt;</span></span></h3>
<div class="outline-text-3" id="text-orgabeceb9">
</div>
<div id="outline-container-org35a5a10" class="outline-4">
<h4 id="org35a5a10">温度</h4>
<div class="outline-text-4" id="text-org35a5a10">
</div>
<ul class="org-ul">
<li><a id="org106edd8"></a>容量，阻抗和自放电<br /></li>
<li><a id="org3554992"></a>基线：静息温度，<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.7)</p>
</div>
</body>
</html>